BCPH357/stm32n6_rppg/stm32_rppg/Appli/Core/Src/main.c
__weak int _write(int fd, char * ptr, int len){
  HAL_UART_Transmit(&huart1, (uint8_t *) ptr, len, HAL_MAX_DELAY);
  return len;
}

/**
  * @brief Configure MPU region for framebuffer as non-cacheable
  * @retval None
  */
static void MPU_Config_Framebuffer(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};
  MPU_Attributes_InitTypeDef MPU_Attr = {0};

  HAL_MPU_Disable();

  /* Attributes index 1: normal memory, non-cacheable, inner/outer */
  MPU_Attr.Number = MPU_ATTRIBUTES_NUMBER1;
  MPU_Attr.Attributes = INNER_OUTER(MPU_NOT_CACHEABLE);
  HAL_MPU_ConfigMemoryAttributes(&MPU_Attr);

  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.AttributesIndex = MPU_ATTRIBUTES_NUMBER1;
  MPU_InitStruct.BaseAddress = BUFFER_ADDRESS;
  MPU_InitStruct.LimitAddress = BUFFER_ADDRESS + 0xFFFFF; /* 1MB region */
  MPU_InitStruct.AccessPermission = MPU_REGION_ALL_RW;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_INNER_SHAREABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

/* Camera helper functions removed; BSP driver handles sensor/ISP */
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
/* USER CODE BEGIN 4 */
/**
  * @brief DCMIPP Initialization Function
  * @param None
  * @retval None
  */
static void MX_DCMIPP_Init(void)
{
  /* USER CODE BEGIN DCMIPP_Init 0 */
	 printf(">>> Enter FSBL MX_DCMIPP_Init()\n");
  /* USER CODE END DCMIPP_Init 0 */
  DCMIPP_PipeConfTypeDef pPipeConf = {0};
  DCMIPP_CSI_PIPE_ConfTypeDef pCSIPipeConf = {0};
  DCMIPP_CSI_ConfTypeDef csiconf = {0};
  DCMIPP_DownsizeTypeDef DonwsizeConf ={0};

  /* Set DCMIPP instance */
  hdcmipp.Instance = DCMIPP;
  if (HAL_DCMIPP_Init(&hdcmipp) != HAL_OK)
  {
    Error_Handler();
  }

  /* Configure the CSI */
  csiconf.DataLaneMapping = DCMIPP_CSI_PHYSICAL_DATA_LANES;
  csiconf.NumberOfLanes   = DCMIPP_CSI_TWO_DATA_LANES;
  csiconf.PHYBitrate      = DCMIPP_CSI_PHY_BT_1600;
  if(HAL_DCMIPP_CSI_SetConfig(&hdcmipp, &csiconf) != HAL_OK)
  {
    Error_Handler();
  }
  /* Configure the Virtual Channel 0 */
  /* Set Virtual Channel config */
  if(HAL_DCMIPP_CSI_SetVCConfig(&hdcmipp, DCMIPP_VIRTUAL_CHANNEL0, DCMIPP_CSI_DT_BPP10) != HAL_OK)
  {
    Error_Handler();
  }

  /* Configure the serial Pipe */
  pCSIPipeConf.DataTypeMode = DCMIPP_DTMODE_DTIDA;
  pCSIPipeConf.DataTypeIDA  = DCMIPP_DT_RAW10;
  pCSIPipeConf.DataTypeIDB  = DCMIPP_DT_RAW10; /* Don't Care */


  if (HAL_DCMIPP_CSI_PIPE_SetConfig(&hdcmipp, DCMIPP_PIPE1, &pCSIPipeConf) != HAL_OK)
  {
    Error_Handler();
  }

  pPipeConf.FrameRate  = DCMIPP_FRAME_RATE_ALL;
  pPipeConf.PixelPackerFormat = DCMIPP_PIXEL_PACKER_FORMAT_RGB565_1;

  /* Set Pitch for Main and Ancillary Pipes */
  pPipeConf.PixelPipePitch  = 1600 ; /* Number of bytes */

  /* Configure Pipe */
  if (HAL_DCMIPP_PIPE_SetConfig(&hdcmipp, DCMIPP_PIPE1, &pPipeConf) != HAL_OK)
  {
    Error_Handler();
  }

  /* Configure the downsize */
  DonwsizeConf.HRatio      = 25656;
  DonwsizeConf.VRatio      = 33161;
  DonwsizeConf.HSize       = 800;
  DonwsizeConf.VSize       = 480;
  DonwsizeConf.HDivFactor  = 316;
  DonwsizeConf.VDivFactor  = 253;

  if(HAL_DCMIPP_PIPE_SetDownsizeConfig(&hdcmipp, DCMIPP_PIPE1, &DonwsizeConf) != HAL_OK)
  {
    Error_Handler();
  }
  if(HAL_DCMIPP_PIPE_EnableDownsize(&hdcmipp, DCMIPP_PIPE1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN DCMIPP_Init 2 */
  /* USER CODE END DCMIPP_Init 2 */
}

/**
  * @brief  Probe and initialize IMX335 sensor
  * @param  Resolution Sensor resolution
  * @param  PixelFormat Pixel format
  * @retval IMX335 status
  */
static int32_t IMX335_Probe(uint32_t Resolution, uint32_t PixelFormat)
{
  IMX335_IO_t IOCtx;
  uint32_t id;

  printf("[IMX335] Configuring I/O context...\r\n");

  /* Configure the camera driver I/O functions */
  IOCtx.Address     = CAMERA_IMX335_ADDRESS;
  IOCtx.Init        = BSP_I2C1_Init;
  IOCtx.DeInit      = BSP_I2C1_DeInit;
  IOCtx.ReadReg     = BSP_I2C1_ReadReg16;
  IOCtx.WriteReg    = BSP_I2C1_WriteReg16;
  IOCtx.GetTick     = BSP_GetTick;

  printf("[IMX335] Registering bus I/O...\r\n");

  /* Register bus I/O */
  if (IMX335_RegisterBusIO(&IMX335Obj, &IOCtx) != IMX335_OK)
  {
    printf("[ERROR] IMX335 RegisterBusIO failed\r\n");
    return IMX335_ERROR;
  }

  printf("[IMX335] Reading sensor ID...\r\n");

  /* Read sensor ID */
  if (IMX335_ReadID(&IMX335Obj, &id) != IMX335_OK)
  {
    printf("[ERROR] IMX335 ReadID failed\r\n");
    return IMX335_ERROR;
  }

  printf("[IMX335] Sensor ID read: 0x%lX (expected 0x%X)\r\n", id, IMX335_CHIP_ID);

  /* Verify sensor ID */
  if (id != (uint32_t)IMX335_CHIP_ID)
  {
    printf("[ERROR] IMX335 chip ID mismatch\r\n");
    return IMX335_ERROR;
  }

  printf("[IMX335] Initializing sensor (resolution: %lu, format: %lu)...\r\n", Resolution, PixelFormat);

  /* Initialize sensor */
  if (IMX335_Init(&IMX335Obj, Resolution, PixelFormat) != IMX335_OK)
  {
    printf("[ERROR] IMX335 Init failed\r\n");
    return IMX335_ERROR;
  }

  printf("[IMX335] Setting frequency to 24MHz...\r\n");

  /* Set input clock frequency */
  if (IMX335_SetFrequency(&IMX335Obj, IMX335_INCK_24MHZ) != IMX335_OK)
  {
    printf("[ERROR] IMX335 SetFrequency failed\r\n");
    return IMX335_ERROR;
  }

  /* Read MODE_SELECT after init */
  {
    uint8_t mode = 0xFF;
    imx335_read_reg(&IMX335Obj.Ctx, IMX335_REG_MODE_SELECT, &mode, 1);
    printf("[IMX335] MODE_SELECT after init = 0x%02X\r\n", mode);
  }

  printf("[IMX335] Probe completed successfully\r\n");

  return IMX335_OK;
}

/**
  * @brief  ISP helper: Get sensor info
  */
static ISP_StatusTypeDef GetSensorInfoHelper(uint32_t Instance, ISP_SensorInfoTypeDef *SensorInfo)
{
  (void)Instance;
  return (ISP_StatusTypeDef) IMX335_GetSensorInfo(&IMX335Obj, (IMX335_SensorInfo_t *)SensorInfo);
}

/**
  * @brief  ISP helper: Set sensor gain
  */
static ISP_StatusTypeDef SetSensorGainHelper(uint32_t Instance, int32_t Gain)
{
  (void)Instance;
  isp_gain = Gain;  // Cache the value
  return (ISP_StatusTypeDef) IMX335_SetGain(&IMX335Obj, Gain);
}

/**
  * @brief  ISP helper: Get sensor gain
  */
static ISP_StatusTypeDef GetSensorGainHelper(uint32_t Instance, int32_t *Gain)
{
  (void)Instance;
  *Gain = isp_gain;  // Return cached value
  return ISP_OK;
}

/**
  * @brief  ISP helper: Set sensor exposure
  */
static ISP_StatusTypeDef SetSensorExposureHelper(uint32_t Instance, int32_t Exposure)
{
  (void)Instance;
  isp_exposure = Exposure;  // Cache the value
  return (ISP_StatusTypeDef) IMX335_SetExposure(&IMX335Obj, Exposure);
}

/**
  * @brief  ISP helper: Get sensor exposure
  */
static ISP_StatusTypeDef GetSensorExposureHelper(uint32_t Instance, int32_t *Exposure)
{
  (void)Instance;
  *Exposure = isp_exposure;  // Return cached value
  return ISP_OK;
}



/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
